app/controllers/users_controller.rb

	def create
		user = User.create(user_params)
---
INSERT INTO "users" ("password_digest", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["password_digest", "$2a$10$h..vDKupOk1hPYBti0ZOkOnRLTsSNOsdc6i1u/sVUHa/Q1I4hFdsq"], ["created_at", "2015-05-23 19:30:38.816602"], ["updated_at", "2015-05-23 19:30:38.816602"]]